{
    "home": {
        "title": "Sala principal de los pokemones",
        "pokemon-info": {
            "one": "Los Pokémon son una clase de criaturas inspiradas en animales reales, insectos, objetos, plantas o criaturas mitológicas. Los jugadores toman el papel Entrenadores Pokémon y tienen tres objetivos generales: completar la Pokédex mediante la recopilación de todas las especies de Pokémon disponibles que se encuentran, entrenar un equipo de Pokémon poderosos de aquellos que han atrapado para competir contra otros entrenadores. El objetivo final del juego es llegar a ganar la Liga Pokémon y convertirse en el campeón regional. La temática de coleccionar, entrenar y luchar están presentes en casi todas las versiones de la franquicia Pokémon, incluidos los videojuegos, las series de anime y manga, y el juego de cartas coleccionables Pokémon.",
            "two": "En la saga principal, el jugador emprenderá un viaje en el que deberá recorrer una región específica del mundo Pokémon. En determinadas ciudades existen una serie de poderosos entrenadores, conocidos como Líderes de Gimnasio, que el entrenador debe derrotar para obtener las medallas de gimnasio y poder progresar. Una vez que se recogen todas las medallas de la región, el entrenador es elegible para desafiar la Liga Pokémon de la región, donde le esperan cuatro de los mejores entrenadores a los que se deberá enfrentar para obtener el título de Campeón.",
            "three": "La saga también tiene arcos argumentales secundarios: En la mayoría de títulos existe un equipo antagonista, una banda cuyos planes están relacionados con el tráfico, la explotación o el maltrato de Pokémon y que el jugador deberá derrotar. Muchos títulos también implican que el jugador pueda desentrañar misterios sobre la existencia de Pokémon legendarios o míticos."
        },
        "web": {
            "title": "Explicación de sitio web",
            "info": {
                "one": "Web dedicada al muestreo de Pokémons, esta realiza peticiones a la API de pokeapi.co. Se realizan 2 tipos de peticiones a la API, una para recoger varios pokemons en una clase, y otra petición para coger datos específicos de cada Pokémon.",
                "two": "El listado completo de Pokemons se utiliza solo para el filtrado de pokemons, para el muestreo del listado se utiliza una lista de tan solo 25 Pokémons, en esta lista tenemos información sobre la siguiente lista de 25 pokemons así como la anterior. Este aspecto es algo a mejorar, ya que lo correcto sería descargar todos los Pokemons de una vez y recoger de esa misma lista los 25 Pokemons a mostrar.",
                "three": "Dependiendo del equipo puede tardar bastante en cargar todos los pokemons.",
                "four": "Translation applied only to this part of the website, translating the whole website would be repeating the same steps, it is a slow and tedious process and that is why I decided to translate only this part of the website. Translation done with the help of deepl.com"
            }
        }
    },

    "header":{
        "list": "Lista"
    },

    "footer":{
        "about": "Sobre nosotros"
    }
}